import { FC } from 'react'

import { Page } from '@/components/Page'
import { Button } from '@/components/ui/Button'
import { openLink } from '@telegram-apps/sdk-react'

export const InfoPage: FC = () => {
	return (
		<Page>
			<div className='flex flex-col items-start gap-3 px-5'>
				<div>
					<span className='text-lg font-bold'>Правила игры:</span>

					<ul className='list-disc pl-5 text-sm'>
						<li>
							Игрок может сделать ставку своим коллекционным
							подарком (гифтом) или нфт.
						</li>
						<li>
							Игроки играют друг против друга и чем больше сумма
							их ставок, тем больше шансов на победу.
						</li>
						<li>
							Игрок, который победил, забирает все ставки себе
							после оплаты комиссии.
						</li>
					</ul>
				</div>

				<div>
					<span className='text-lg font-bold'>Инструкция:</span>

					<ul className='list-disc pl-5 text-sm'>
						<li>
							Подключите Ваш кошелёк к приложению для получения
							оплаты за приведенных игроков, перевода нфт и оплаты
							комиссий.
						</li>
						<li>
							Напишите боту
							<Button
								className='text-light-blue px-1'
								onClick={() =>
									openLink('https://t.me/gift_rouletton')
								}
							>
								@gift_rouletton
							</Button>
							любое сообщение, а затем отправьте ему гифт.
						</li>
						<li>
							Ваш гифт появится во вкладке My Gifts с кнопкой Bet.
							Ваши нфт на подключенном кошельке отображаются во
							вкладке Deposit, откуда вы можете их перевести на
							площадку с помощью транзакции. После перевода нфт,
							они также как и гифты появятся во вкладке My Gifts.
						</li>
						<li>
							Нажав кнопку Bet, ваш гифт или нфт отправляется в
							розыгрыш раунда. ВНИМАНИЕ: Вы можете поставить
							сколько угодно гифтов и нфт только один раз за
							раунд. Поставив гифты со вкладки My Gifts, вы
							переходите во вкладку розыгрыша и более не можете
							ставить в этом раунде.
						</li>
						<li>
							После победы, гифты и нфт отправляются на ваш
							игровой аккаунт. Вы можете их снова поставить или
							вывести только после оплаты комиссии 5% от выигрыша.
						</li>
						<li>
							Вывод осуществляется со вкладки Withdraw. Комиссия
							на вывод гифтов Вам на аккаунт = 25 звезд. Комиссия
							на вывод нфт определяется в стандартной транзакции
							на Ваш крипто-кошелек.
						</li>
					</ul>
				</div>

				<div>
					<span className='text-lg font-bold'>Дополнительно:</span>

					<ul className='list-disc pl-5 text-sm'>
						<li>
							Раунд начинается, если в игру зашло более 1-го
							игрока.
						</li>
						<li>Длительность раунда 3 минуты.</li>
						<li>
							Комиссия площадки 5% с выигрыша игрока за вычетом
							его ставки.
						</li>
						<li>
							Нажав кнопку Bet, ваш гифт или нфт отправляется в
							розыгрыш раунда. ВНИМАНИЕ: Вы можете поставить
							сколько угодно гифтов и нфт только один раз за
							раунд. Поставив гифты со вкладки My Gifts, вы
							переходите во вкладку розыгрыша и более не можете
							ставить в этом раунде.
						</li>
						<li>
							После победы, гифты и нфт отправляются на ваш
							игровой аккаунт. Вы можете их снова поставить или
							вывести только после оплаты комиссии 5% от выигрыша.
						</li>
						<li>
							Вывод осуществляется со вкладки Withdraw. Комиссия
							на вывод гифтов Вам на аккаунт = 25 звезд. Комиссия
							на вывод нфт определяется в стандартной транзакции
							на Ваш крипто-кошелек.
						</li>
					</ul>
				</div>

				<div>
					<span className='font-bold'>Fair Play:</span>

					<ul className='list-disc pl-5 text-sm'>
						<li>
							Система честной игры работает таким образом, что
							победитель определяется с помощью "Числа раунда",
							которое случайным образом генерируется в начале
							игры.
						</li>
						<li>
							Число раунда зашифровывается с помощью MD5, и этот
							хэш показывается в начале каждого раунда.
						</li>
						<li>
							Хэш также содержит рандомную строку (Секрет), чтобы
							предотвратить расшифровку.
						</li>
						<li>
							В конце раунда система показывает то самое
							расшифрованное "Число раунда" и "Секрет", которые
							были зашифрованы в самом начале, и вы сможете
							проверить, что "Число раунда" не менялось на
							протяжении игры.
						</li>
						<li>
							Число раунда умножается на общее количество ячеек в
							раунде и таким образом выбирается победная ячейка. У
							кого из игроков будет данная победная ячейка, тот и
							окажется победителем.
						</li>
						<li>
							То есть принцип честной игры работает таким образом,
							что мы никак не можем знать сколько ячеек будет на
							момент завершения раунда, а "Число раунда" для
							умножения дается в самом начале раунда.
						</li>
					</ul>
				</div>

				<div>
					<span className='font-bold'>Выбор победителя:</span>

					<ul className='list-disc pl-5 text-sm'>
						<li>
							Каждый депозит переводится в билеты. Билеты
							сортируются по времени депозита.
						</li>
						<li>
							Номер победного билета считается по следующей
							формуле: floor(число билетов * число раунда) + 1 =
							победитель
						</li>
						<li>
							(функция floor возвращает ближайшее целое число,
							округляя переданное ей число в меньшую сторону).
						</li>
						<li>
							Игрок, у которого будет выбранный победный билет и
							окажется победителем в раунде.
						</li>
					</ul>
				</div>
			</div>
		</Page>
	)
}
